"""
Запуск обучения YOLO

Скачивает базовую YOLO11 и запускает процесс обучения на данных.

Вход: Подготовленный датасет.
Выход: Файл best.pt (дообученная модель).
"""

from ultralytics import YOLO
from pathlib import Path
import os
import config

os.environ["KMP_DUPLICATE_LIB_OK"] = "TRUE"

def train():
    # 1. Загружаем модель
    # yolo11n.pt - самая быстрая (nano). Скачается сама.
    print("⏳ Загрузка модели...")
    model = YOLO(config.YOLO_MODEL_NAME)

    # Путь к yaml файлу, который создал предыдущий скрипт
    data_yaml = Path("datasets/prepared/data.yaml")

    print("🚀 Начинаем обучение...")

    # 2. Запуск обучения
    # epochs=100 -> Нейросеть посмотрит все фото 100 раз.
    # imgsz=640 -> Размер картинки для анализа.
    # device=0 -> Использовать первую видеокарту (NVIDIA).
    try:
        results = model.train(
            data=str(data_yaml),
            epochs=100,
            imgsz=640,
            device=0,

            # === ПАРАМЕТРЫ БЕЗОПАСНОСТИ ===
            batch=2,  # Ставим 2! Если заработает, потом попробуем 4 или 8.
            workers=0,  # ОБЯЗАТЕЛЬНО 0.
            amp=False,  # Отключаем ускорение AMP (бывает нестабильно на 40xx Mobile)
            plots=True,  # Не рисовать графики (экономим память)
            save=True,  # Сохранять веса
            val=True,  # Валидация включена
            name="your_class",  # Имя папки с результатами
            patience=20  # Если 20 эпох нет улучшений - стоп (Early Stopping)
            )

        print("🏁 Обучение завершено!")
        print(f"Лучшая модель сохранена здесь: runs/detect/your_class/weights/best.pt")

    except Exception as e:
        print(f"\n❌ ПРОИЗОШЛА ОШИБКА Python: {e}")
        import traceback
        traceback.print_exc()

if __name__ == "__main__":
    train()