"""Файл настроек (пути, названия моделей)"""

import torch
from pathlib import Path

# === 📂 Пути к папкам ===
BASE_DIR = Path(__file__).parent

# Входные данные (твои 100к фото)
INPUT_DIR = BASE_DIR / "images_input"

# Выходные данные (чистые фото)
OUTPUT_DIR = BASE_DIR / "images_cleaned"

# Папка для логов
LOG_DIR = BASE_DIR / "logs"

# Папка, где лежат веса моделей
MODELS_DIR = BASE_DIR / "models"

# === 🧠 Настройки Моделей ===

# 1. DETECTOR (YOLO)
YOLO_MODEL_NAME = "yolo11n.pt"
# Сюда ты должен будешь скопировать свой best.pt после обучения
YOLO_MODEL_PATH = MODELS_DIR / "best.pt"
YOLO_CONFIDENCE = 0.25  # Порог уверенности (если < 25%, считаем, что твоего класса нет)

# 2. SEGMENTER (SAM 2)
# Модель скачается сама, но имя укажем здесь
SAM_MODEL_NAME = "sam2.1_b.pt" # b = base (баланс скорости/качества)

# === ⚙️ Системные настройки ===
# Автоматическое определение видеокарты
DEVICE = "cuda" if torch.cuda.is_available() else "cpu"

# Создаем папки, если их нет
def setup_directories():
    for path in [INPUT_DIR, OUTPUT_DIR, LOG_DIR, MODELS_DIR]:
        path.mkdir(parents=True, exist_ok=True)

# Запускаем создание папок при импорте
setup_directories()